### Exception case dictionary ###
EXC_4_deal_1 = [
    
     ['ㄷㅏ',['ㄴ','ㅂㄴㅣㄷㅏ'],'ㅅㅡㅂㄴㅣㄷㅏ'],
]

EXC_4_deal_2 = [
    
    ['ㄴㅣ',['ㅆ','ㅇㅓㅇㅛ'],'ㅇㅛ']
]

EXC_4_deal_3 = [
    
    ['ㄴㅡㄴㄱㅏ',['ㅗ','ㅗ','ㅏㅇㅛ'],['ㅜ','ㅜ','ㅓㅇㅛ'],['ㅏ','ㅏ','ㅣㅇㅛ'],'ㅇㅓㅇㅛ'],
    ['ㄷㅏ',['ㅆ','ㅆ','ㅅㅡㅂㄴㅣㄷㅏ'],['ㄴ','ㅂ','ㄴㅣㄷㅏ'],['ㄹ','ㅂ','ㄴㅣㄷㅏ'],['ㅂ','ㅂ','ㅅㅡㅂㄴㅣㄷㅏ'],'ㅂㄴㅣㄷㅏ'],
    ['ㄴㅣ',['ㅆ','ㅆ','ㅇㅓㅇㅛ'],'ㅇㅛ']
]

EXC_4_deal_4 = [
    
    ['ㄱㅔ','ㄱㅔㅇㅛ',[['ㄵ','ㄵ','ㅇㅡㅅㅔㅇㅛ'],['ㄱ','ㄱ','ㅇㅡㅅㅔㅇㅛ'],['ㄷ','ㄷ','ㅇㅡㅅㅔㅇㅛ'],['ㅜㅂ','ㅜ','ㅇㅡㅅㅔㅇㅛ'],['ㅂ','ㅂ','ㅇㅡㅅㅔㅇㅛ'],'ㅅㅔㅇㅛ'],'ㄱㅔ'],
    ['ㄷㅔ','ㄷㅔㅇㅛ',[['','',''],''],'ㄷㅔ'],
    ['ㄴㅔ','ㄴㅔㅇㅛ',[['','',''],''],'ㄴㅔ'],
    ['ㄱㅓㄹ','ㄱㅓㄹㅇㅛ',[['','',''],''],'ㄱㅓㄹ']
]