EXC_deal_1 = [
    
    ['ㅅㅔㅇㅛ', ['ㅏ','ㅣ'],['ㅜ','ㅓ'],['ㅡ','ㅓ'],['ㅗ','ㅏ']],
    ['ㅅㅣㅂㅅㅛ',['ㅏ','ㅣ'],['ㅜ','ㅓ'],['ㅡ','ㅓ'],['ㅗ','ㅏ']],
]

EXC_deal_2 = [
    
    ['ㅈㅓㄴ','ㅈㅓㄴ','ㄴㅏㄴ'],
]

EXC_deal_3 = [
    
    ['ㅅㅡㅂㄴㅣㄷㅏ',[['ㅆ','ㄷㅏ'],['ㅎ','ㄷㅏ'],['ㅂ','ㄷㅏ'],['ㅌ','ㄷㅏ'],['ㅍ','ㄷㅏ'],['ㄵ','ㄷㅏ']],'ㄴㅡㄴㄷㅏ'],
    ['ㅇㅣㅂㄴㅣㄲㅏ',[['ㄹ','ㅇㅣㅇㅑ'],['ㅂ','ㅇㅣㅇㅑ'],['ㅅ','ㅇㅣㅇㅑ'],['ㄷ','ㅇㅣㅇㅑ'],['ㅁ','ㅇㅣㅇㅑ'],['ㄴ','ㅇㅣㅇㅑ'],['ㄱ','ㅇㅣㅇㅑ'],['ㅄ','ㅇㅣㅇㅑ'],['ㅇ','ㅇㅣㅇㅑ'],['ㅈㅗ','ㅇㅕ']],'ㅇㅑ'],
    ['ㅇㅣㅂㄴㅣㄷㅏ',[['ㄹ','ㅇㅣㅇㅑ'],['ㅂ','ㅇㅣㅇㅑ'],['ㅅ','ㅇㅣㅇㅑ'],['ㄷ','ㅇㅣㅇㅑ'],['ㅁ','ㅇㅣㅇㅑ'],['ㄴ','ㅇㅣㅇㅑ'],['ㄱ','ㅇㅣㅇㅑ'],['ㅄ','ㅇㅣㅇㅑ'],['ㅇ','ㅇㅣㅇㅑ'],['ㅈㅗ','ㅇㅕ']],'ㅇㅑ']
    
]